"""Есть удобный математический способ:
Перемножьте модули разниц по горизонтали и вертикали. Если результат равен 2, ход правильный.

· Пример для c3-d5: (1 шаг по букве) * (2 шага по цифре) = 1 * 2 = 2. Всё верно.
· Пример для e2-e4: (0 шагов по букве) * (2 шага по цифре) = 0 * 2 = 0. Неверно."""

n = input().split("-")
h1 = n[0]
h2 = n[1]
h1_1 = h1[0]
h1_2 = int(h1[1])
h2_1 = h2[0]
h2_2 = int(h2[1])
h1_1 =int( h1_1.replace("a", "1").replace("b", "2").
           replace("c", "3").replace("d", "4").
           replace("e", "5").replace("f", "6").
           replace("g", "7").replace("h", "8"))
h2_1 = int( h2_1.replace("a", "1").replace("b", "2")
            .replace("c", "3").replace("d", "4").
            replace("e", "5").replace("f", "6").
            replace("g", "7").replace("h", "8"))
if abs(h1_1 - h2_1) * abs(h1_2 - h2_2) == 2:
    print("верно")
else:
    print("ошибка")
